import { IBook } from "../types/book";

export const startBooks: IBook[] = [
  {
    id: "NYQsLG5Y1sbLFxyAic4S",
    title: "Тонкое искусство пофигизма",
    photoURL:
      "https://cv1.litres.ru/pub/c/elektronnaya-kniga/cover_415/25440816-mark-menson-tonkoe-iskusstvo-pofigizma.jpg",
    authors: ["Марк Мэнсон"],
    description:
      "Современное общество пропагандирует культ успеха: будь умнее, богаче, продуктивнее – будь лучше всех. Соцсети изобилуют историями на тему, как какой-то малец придумал приложение и заработал кучу денег, статьями в духе «Тысяча и один способ быть счастливым», а фото во френдленте создают впечатление, что окружающие живут лучше и интереснее, чем мы. Однако наша зацикленность на позитиве и успехе лишь напоминает о том, чего мы не достигли, о мечтах, которые не сбылись. Как же стать по-настоящему счастливым? Популярный блогер Марк Мэнсон в книге «Тонкое искусство пофигизма» предлагает свой, оригинальный подход к этому вопросу. Его жизненная философия проста – необходимо научиться искусству пофигизма. Определив то, до чего вам действительно есть дело, нужно уметь наплевать на все второстепенное, забить на трудности, послать к черту чужое мнение и быть готовым взглянуть в лицо неудачам и показать им средний палец.",
    ISBN: "9785961448986",
    rating: 10,
    year: 2013,
  },
  {
    id: "eyj4XhxGCkXLIBOTCGbn",
    title: "Идеальный программист. Как стать профессионалом разработки ПО",
    photoURL:
      "https://cv9.litres.ru/pub/c/elektronnaya-kniga/cover_330/11961798-robert-s-martin-idealnyy-programmist-kak-stat-professionalom-razrabotki-po.jpg",
    authors: ["Роберт Мартин"],
    description:
      "Всех программистов, которые добиваются успеха в мире разработки ПО, отличает один общий признак: они больше всего заботятся о качестве создаваемого программного обеспечения. Это – основа для них. Потому что они являются профессионалами своего дела.\nВ этой книге легендарный эксперт Роберт Мартин (более известный в сообществе как «Дядюшка Боб»), автор бестселлера «Чистый код», рассказывает о том, что значит «быть профессиональным программистом», описывая методы, инструменты и подходы для разработки «идеального ПО». Книга насыщена практическими советами в отношении всех аспектов программирования: от оценки проекта и написания кода до рефакторинга и тестирования. Эта книга – больше, чем описание методов, она о профессиональном подходе к процессу разработки.",
    ISBN: "978-5-459-01044-2",
    rating: 5,
    year: 2011,
  },
  {
    id: "eyj4XhxGCkXLIBOTCG2n",
    title: "Практическое руководство по винокурению.",
    photoURL:
      "https://cv9.litres.ru/pub/c/pdf-kniga/cover_330/63995791-pavel-ievlev-prakticheskoe-rukovodstvo-po-vinokureniu-domashnee-p-63995791.jpg",
    authors: ["Павел Иевлев"],
    description:
      "«Практическое руководство по винокурению» – основанный на более чем двадцатилетнем опыте автора настольный справочник для тех, кто хочет сам создавать качественные алкогольные напитки. Книга содержит описание сырья, технологий и оборудования для домашней дистилляции, а также большую коллекцию базовых и авторских рецептов. Ее отличие от большинства других пособий – систематизированный практический подход, оптимизированный по соотношению сложности и информативности. Кроме того, книга ориентирована на современное любительское оборудование, доступное сейчас каждому.",
    ISBN: "978-5-04-088830-6",
    rating: 5,
    year: 2021,
  },
  {
    id: "eyj4XhxGCkXLIBOTCG3n",
    title: "7 навыков высокоэффективных людей",
    photoURL:
      "https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_330/4239285--.jpg",
    authors: ["Стивен Кови"],
    description:
      "Во-первых, эта книга излагает системный подход к определению жизненных целей, приоритетов человека. Эти цели у всех разные, но книга помогает понять себя и четко сформулировать жизненные цели. Во-вторых, книга показывает, как достигать этих целей. И в-третьих, книга показывает, как каждый человек может стать лучше. Причем речь идет не об изменении имиджа, а о настоящих изменениях, самосовершенствовании. Книга не дает простых решений и не обещает мгновенных чудес. Любые позитивные изменения требуют времени, работы и упорства. Но для людей, стремящихся максимально реализовать потенциал, заложенный в них природой, эта книга – дорожная карта.",
    ISBN: "978-5-9614-2021-0",
    rating: 5,
    year: 1989,
  },
  {
    id: "eyj4XhxGCkXLIBOTC15n",
    title: "Цвет волшебства",
    photoURL:
      "https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_330/120988-terri-pratchett-cvet-volshebstva.jpg",
    authors: ["Терри Пратчетт"],
    description:
      "Это Великий А’Туин, Вселенская Черепаха, которая бороздит безбрежный космос. Это четыре слона, которые держат на спинах Плоский мир. А это Ринсвинд, самый трусливый волшебник на Диске, и Двацветок, первый турист Плоского мира. Неисчислимые тролли, драконы, волки и Смерть (одна штука) поджидают их в скитаниях по дотоле неведомой нам сказочной вселенной.",
    ISBN: "978-5-699-15629-0",
    rating: 5,
    year: 2011,
  },
  {
    id: "eyj4XhxGCkXLIBOTC13n",
    title: "Психбольница в руках пациентов",
    photoURL:
      "https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_330/31736385-alan-kuper-psihbolnica-v-rukah-pacientov-alan-kuper-ob-interfeysah.jpg",
    authors: ["Алан Купер"],
    description:
      "Все мы – безумцы, живущие в технологическом сумасшедшем доме, и создали этот безумный мир мы сами. Своими руками сотворили этот кошмар: интерфейсы, которые нас раздражают и утомляют глаза, устройства, которые приводят к болям в спине и в запястьях. Эта книга стала манифестом и до сих пор не потеряла актуальность. Дверь на свободу распахнута. Почему же мы не замечаем выхода? Об этом и рассказывает Алан Купер, объясняя разницу между интерфейсом и взаимодействием\nЭй, ребята, у вас тут полно обозленных клиентов. Вам есть что им ответить?",
    ISBN: "978-5-4461-0674-5",
    rating: 4,
    year: 2004,
  },
  {
    id: "eyj4XhxGCkXLIBOs145n",
    title: "Интрижки мишки",
    photoURL:
      "https://cv5.litres.ru/pub/c/elektronnaya-kniga/cover_330/64662058-elena-vilorzhevna-galenko-intrizhki-mishki.jpg",
    authors: ["Елена Галенко"],
    year: 2021,
  },
  {
    id: "eyj4XhxGCkXLIBOTC130",
    title: "Чистый код: создание, анализ и рефакторинг",
    photoURL:
      "https://cv7.litres.ru/pub/c/pdf-kniga/cover_330/6444478-robert-s-martin-chistyy-kod-sozdanie-analiz-i-refaktoring-6444478.jpg",
    authors: ["Роберт Мартин"],
    description:
      "Даже плохой программный код может работать. Однако если код не является «чистым», это всегда будет мешать развитию проекта и компании-разработчика, отнимая значительные ресурсы на его поддержку и «укрощение».\n\nЭта книга посвящена хорошему программированию. Она полна реальных примеров кода. Мы будем рассматривать код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Прочитав книгу, вы узнаете много нового о коде. Более того, вы научитесь отличать хороший код от плохого. Вы узнаете, как писать хороший код и как преобразовать плохой код в хороший.\n\nКнига состоит из трех частей. В первой части излагаются принципы, паттерны и приемы написания чистого кода; приводится большой объем примеров кода. Вторая часть состоит из практических сценариев нарастающей сложности. Каждый сценарий представляет собой упражнение по чистке кода или преобразованию проблемного кода в код с меньшим количеством проблем. Третья часть книги – концентрированное выражение ее сути. Она состоит из одной главы с перечнем эвристических правил и «запахов кода», собранных во время анализа. Эта часть представляет собой базу знаний, описывающую наш путь мышления в процессе чтения, написания и чистки кода.",
    ISBN: "978-5-496-00487-9",
    rating: 5,
  },
  {
    id: "eyj4XhxGCkXLIBOTC792",
    title: "Джордж и Большой взрыв",
    photoURL:
      "https://cv7.litres.ru/pub/c/elektronnaya-kniga/cover_330/9360274-stiven-hoking-dzhordzh-i-bolshoy-vzryv.jpg",
    authors: ["Стивен Хокинг", "Люси Хокинг"],
    description:
      "Три, два, один, ПУСК! Стартует третья книга про Джорджа, Анни, ученого Эрика Беллиса, суперкомпьютер Космос и полный загадок мир вокруг нас!\n\nПрофессор Эрик работает над масштабной «теорией всего» и катается на лунном ровере. Компьютер Космос ищет пристанище для поросенка Фредди, которого бабушка подарила Джорджу на день рождения. У Анни появляется новый друг, сын режиссера и скейтбордист… а в этом время в одном из темных подвалов университета Фоксбридж зреет заговор против исследований Эрика, плетутся интриги и готовится разрушительная бомба!\n\nДжорджу и Анни предстоит спасти рассеянного ученого и его коллег, а заодно узнать, как возникла наша Вселенная, что связывает вакуум и пылесосы, есть ли в космосе другие солнечные системы, похожие на нашу, что такое законы Ньютона и теория относительности и многое-многое другое. \n\nЗахватывающий сюжет и простота, с которой Стивен и Люси Хокинг рассказывают о сложных вещах, способны пробудить интерес к науке даже в каменной статуе. А уж любознательным детям и взрослым гарантирован полный научно-развлекательный восторг.",
    ISBN: "978-5-4370-0089-2",
    rating: 5,
    year: 2011,
  },
];
